# data-database-types-relational-language-SQL-MySQL-C_R_UD-read-command-SELECT-process
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **mysql** - **sql** - provides many **tools** for **manipulating** **databases** - when **combined** can be a **powerful** **data** **analyse** **tool** for databases [1]

```sql
mysql> use lab1;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab1 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

- returned - rows - records - tuples - of columns - attributes - fields - name - age - plus **column** - attribute - field - **function** - **MONTHNAME** - **parameter** - **column** - attribute - field - dob - **obtains** **name** **of** **month** [1]

```sql
mysql> SELECT name,age,MONTHNAME(dob)
    -> FROM person;
+-------+------+----------------+
| name  | age  | MONTHNAME(dob) |
+-------+------+----------------+
| John  |   23 | January        |
| Tom   |   64 | March          |
| Mary  |   12 | April          |
| Alan  |   12 | November       |
| Pat   |   29 | March          |
| Shane |   40 | July           |
| Shane |   14 | June           |
| Alice |   24 | March          |
| Pat   |   37 | April          |
+-------+------+----------------+
9 rows in set (0.00 sec)
```

- returned - amendment - rows - records - tuples - of columns - attributes - fields - **clause** - **WHERE** - **function** - **DAY** - parameter - dob - obtain day part of the date of birth - **operator** - **BETWEEN** - first day of the month - **operator** - **AND** - eleventh day of the month [1]

```sql
mysql> SELECT name,age,MONTHNAME(dob)
    -> FROM person
    -> WHERE DAY(dob) BETWEEN 1 AND 11;
+-------+------+----------------+
| name  | age  | MONTHNAME(dob) |
+-------+------+----------------+
| John  |   23 | January        |
| Tom   |   64 | March          |
| Mary  |   12 | April          |
| Shane |   14 | June           |
| Alice |   24 | March          |
+-------+------+----------------+
5 rows in set (0.00 sec)
```

- returned - amendment - rows - records - tuples - of columns - attributes - fields - **operator** - **AND** - **column** - attribute - field - name - **operator** - **NOT** - **operator** - **LIKE** - **starts** **with** **letter** - "A" [1]

```sql
mysql> SELECT name,age,MONTHNAME(dob)
    -> FROM person
    -> WHERE DAY(dob) BETWEEN 1 AND 11
    -> AND name NOT LIKE "A%";
+-------+------+----------------+
| name  | age  | MONTHNAME(dob) |
+-------+------+----------------+
| John  |   23 | January        |
| Tom   |   64 | March          |
| Mary  |   12 | April          |
| Shane |   14 | June           |
+-------+------+----------------+
4 rows in set (0.00 sec)
```

- returned - amendment - rows - records - tuples - of columns - attributes - fields - **clause** - **ORDER** **BY** - **column** - attribute - field - name - **keyword** - **DESC** - sorted in **reverse** **alphabetical** **order** [1]

```sql
mysql> SELECT name,age,MONTHNAME(dob)
    -> FROM person
    -> WHERE DAY(dob) BETWEEN 1 AND 11
    -> AND name NOT LIKE "A%"
    -> ORDER BY name DESC;
+-------+------+----------------+
| name  | age  | MONTHNAME(dob) |
+-------+------+----------------+
| Tom   |   64 | March          |
| Shane |   14 | June           |
| Mary  |   12 | April          |
| John  |   23 | January        |
+-------+------+----------------+
4 rows in set (0.00 sec)
```

***
# END